DATABASES = """/Запомни текст как : {"name":"databases", "text":"
Postgres, MySQL, MS SQL Server"}
"""

CRITERIA = """/Запомни текст как : {"name":"criteria", "text":"
Стоимость, Производительность, Масштабируемость,  Наличие навыков работы у текущей команды."}
"""

SYSTEM_CONTEXT = """/Запомни текст как : {"name":"system context", "text":"
Небольшой проект, не требующий высоких нагрузок и больших объемов знаний."}
"""

COMPARISON = """/Запомни текст как : {"name":"comparison", "text":"
1. PostgreSQL — лидер по производительности и гибкости
PostgreSQL показывает наилучшие результаты в большинстве бенчмарков. В одном из тестов он продемонстрировал самую высокую производительность при выполнении операций SELECT, UPDATE и TRUNCATE, а также стабильное время отклика при работе с большими объемами данных (от 1 до 5 миллионов записей). Его превосходство особенно заметно в сложных аналитических запросах и операциях пакетной обработки. В плане масштабируемости PostgreSQL предлагает развитые механизмы репликации, шардирования и партиционирования, что делает его пригодным для растущих нагрузок.

2. Microsoft SQL Server — отличный баланс в экосистеме Microsoft
SQL Server постоянно показывает стабильную производительность, часто занимая второе место после PostgreSQL. Он выделяется как наиболее сбалансированный вариант с точки зрения соотношения 'цена-производительность'. Это хороший выбор для корпоративных сред, особенно если ваша инфраструктура тесно связана с продуктами Microsoft. SQL Server эффективно масштабируется и хорошо интегрируется с бизнес-аналитикой и другими инструментами Microsoft.

3. MySQL — оптимальный выбор для веб-приложений
MySQL показывает умеренную производительность, но при этом потребляет значительно меньше памяти по сравнению с конкурентами. Это делает его идеальным для легковесных приложений и веб-проектов с ограниченными ресурсами, где важна простота и высокая пропускная способность операций чтения. Он отлично масштабируется для высоконагруженных веб-сайтов, уступая PostgreSQL и SQL Server в сложных аналитических задачах.

4. Oracle Database — мощь с оговорками
Oracle часто показывает наихудшие результаты по времени отклика и потреблению памяти в стандартных тестах, особенно при работе с очень большими наборами данных. Он также является самым дорогим в обслуживании решением. Однако Oracle остается выбором для ультра-крупных, высоконагруженных и строго регулируемых корпоративных систем, где его уникальные возможности, надежность и глубокая интеграция перевешивают вопросы производительности и стоимости."}
"""

COMPARISON = """/Запомни текст как : {"name":"comparison", "text":"
1. PostgreSQL — лидер по производительности и гибкости
PostgreSQL показывает наилучшие результаты в большинстве бенчмарков. В одном из тестов он продемонстрировал самую высокую производительность при выполнении операций SELECT, UPDATE и TRUNCATE, а также стабильное время отклика при работе с большими объемами данных (от 1 до 5 миллионов записей). Его превосходство особенно заметно в сложных аналитических запросах и операциях пакетной обработки. В плане масштабируемости PostgreSQL предлагает развитые механизмы репликации, шардирования и партиционирования, что делает его пригодным для растущих нагрузок.
\\n\\n
2. Microsoft SQL Server — отличный баланс в экосистеме Microsoft
SQL Server постоянно показывает стабильную производительность, часто занимая второе место после PostgreSQL. Он выделяется как наиболее сбалансированный вариант с точки зрения соотношения 'цена-производительность'. Это хороший выбор для корпоративных сред, особенно если ваша инфраструктура тесно связана с продуктами Microsoft. SQL Server эффективно масштабируется и хорошо интегрируется с бизнес-аналитикой и другими инструментами Microsoft.
\\n\\n
3. MySQL — оптимальный выбор для веб-приложений
MySQL показывает умеренную производительность, но при этом потребляет значительно меньше памяти по сравнению с конкурентами. Это делает его идеальным для легковесных приложений и веб-проектов с ограниченными ресурсами, где важна простота и высокая пропускная способность операций чтения. Он отлично масштабируется для высоконагруженных веб-сайтов, уступая PostgreSQL и SQL Server в сложных аналитических задачах.
\\n\\n
4. Oracle Database — мощь с оговорками
Oracle часто показывает наихудшие результаты по времени отклика и потреблению памяти в стандартных тестах, особенно при работе с очень большими наборами данных. Он также является самым дорогим в обслуживании решением. Однако Oracle остается выбором для ультра-крупных, высоконагруженных и строго регулируемых корпоративных систем, где его уникальные возможности, надежность и глубокая интеграция перевешивают вопросы производительности и стоимости."}
"""

ADR = """/Запомни текст как : {"name":"Шаблон ADR", "text":"## Контекст ##\\n\\n<!@ system context @!>\\n\\n## Рассматриваемые альтернативы ##\\n\\n<!@ databases @!>\\n\\n### Анализ ###\\n\\n<!@ alternatives @!>\\n\\n## Выбор ##\\n\\n<!@ conclusion @!>\\n\\n## Последствия ##<!@ consequences @>>"}"""